# -*- coding: utf-8 -*-
"""
Created on Wed May 23 16:04:20 2018

@author: Administrator
"""

# =============================================================================
# (1) 对根据具体条件、集合和正则表达式来筛选行数据的一个脚本进行修改，将与示例代码
# 中不同的一组数据打印出来并写入输出文件。
# 
# =============================================================================

# =============================================================================
# (2) 对根据索引值或列标题来筛选列数据的一个脚本进行修改，将与示例代码中不同的一组
# 数据打印出来并写入输出文件。
# =============================================================================


# =============================================================================
# (3) 创建一个新的Python脚本，将筛选行或列的某个脚本中的代码与从多个工作簿中连接
# 数据的某个脚本中的代码组合起来，生成一个新的输出文件，其中包含来自于多个工作
# 簿的特定行与特定列。
# =============================================================================

